9/data/attachments/f32dd90666136df5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b59bebe6-15b4-4d81-9415-b1a2745429cf</nif:username>
            <nif:friendToBeAdded>Derrick_cause_Friend_24954_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>